#+OPTIONS: ^:{}

Stuff for the Sac and Jane paper on turbulence diagnostics

* Radial velocities
:PROPERTIES:
:header-args: :python /Users/will/anaconda/envs/py27/bin/python
:END:

#+BEGIN_SRC python
import sys
return sys.version
#+END_SRC

#+RESULTS:
: 2.7.8 |Anaconda 1.8.0 (x86_64)| (default, Jul  2 2014, 15:36:00) 
: [GCC 4.2.1 (Apple Inc. build 5577)]


#+BEGIN_SRC python :return data
  import numpy as np

  fn = "04052012_4-0003-0030-0001.vstats"

  data = np.genfromtxt(open(fn), names=True).dtype.names
#+END_SRC

#+RESULTS:
| Time | Vr_vol_t | Vr_vol_m | Vr_vol_n | Vr_vol_i | Vr_mass_t | Vr_mass_m | Vr_mass_n | Vr_mass_i | Vr_em_i | Vr_em_if |

#+BEGIN_SRC python :return data
  import numpy as np

  fn = "04052012_4-0003-0030-0001.vstats"

  data = np.genfromtxt(open(fn), names=True)
#+END_SRC

#+RESULTS:
|  3.0 |  -0.1049 |  -0.1049 |    1.798 | 1.902 | 0.4804 | 0.4801 | 0.875 | 1.651 | 1.378 | 2.171 |
|  4.0 |  -0.1018 |  -0.1019 |    6.759 |  2.65 | 0.5463 | 0.5456 | 4.421 | 1.952 | 1.353 | 2.747 |
|  5.0 | -0.09802 | -0.09824 |    10.49 |  3.09 | 0.6147 | 0.6126 | 6.964 | 2.192 | 1.489 | 3.316 |
|  6.0 | -0.09259 | -0.09386 |    4.659 | 4.402 | 0.6896 | 0.6792 | 7.648 | 3.075 | 2.197 |  4.08 |
|  7.0 | -0.08379 | -0.08669 |  0.02801 | 3.881 | 0.7716 | 0.7388 | 5.393 | 3.656 | 2.532 | 5.338 |
|  8.0 | -0.04265 |   -0.068 |  0.05087 | 2.832 | 0.8603 | 0.7923 | 2.804 |  4.67 | 3.374 | 6.555 |
|  9.0 | 0.004222 |  0.02086 |  -0.2425 | 1.254 | 0.9584 | 0.8725 |  1.78 | 4.652 | 3.766 | 7.235 |
| 10.0 |   0.0605 |   0.1377 |  -0.2971 | 1.035 |  1.067 | 0.9672 | 1.594 | 4.432 | 4.049 |  7.62 |
| 11.0 |   0.1886 |   0.2927 |  -0.1983 |  1.13 |  1.189 |  1.051 | 1.683 | 4.471 | 4.603 | 8.039 |
| 12.0 |   0.4017 |   0.3658 | -0.03615 | 2.006 |  1.322 |  1.136 |  1.76 | 5.219 | 5.141 | 8.175 |
| 13.0 |   0.6772 |   0.4042 |   0.1658 | 2.773 |  1.464 |  1.213 | 1.914 | 5.878 | 5.484 |  8.25 |
| 14.0 |    1.068 |   0.4436 |   0.4678 |  3.54 |  1.613 |  1.292 | 2.071 | 6.475 | 5.829 | 8.166 |
| 15.0 |    1.629 |   0.5365 |   0.8554 |  4.52 |  1.767 |  1.369 | 2.244 | 6.912 | 6.011 | 7.981 |
| 16.0 |    2.292 |   0.6423 |    1.368 | 5.395 |  1.923 |  1.449 | 2.425 | 7.121 | 6.005 | 7.809 |
| 17.0 |    2.993 |   0.7487 |    1.892 | 6.234 |  2.077 |  1.527 | 2.618 | 7.192 | 5.894 | 7.633 |
| 18.0 |    3.731 |   0.8269 |    2.491 | 7.039 |  2.227 |  1.604 | 2.813 | 7.269 |   5.8 | 7.505 |
| 19.0 |    4.365 |   0.9033 |    2.973 | 7.596 |  2.367 |  1.677 | 2.997 | 7.287 | 5.661 | 7.365 |
| 20.0 |    4.904 |    1.039 |    3.522 | 7.851 |  2.493 |  1.752 | 3.176 |  7.17 | 5.457 | 7.158 |
| 21.0 |    5.315 |     1.22 |    4.054 |  7.86 |  2.597 |  1.833 | 3.321 | 6.932 | 5.218 | 6.883 |
| 22.0 |    5.587 |    1.384 |    4.595 | 7.702 |  2.687 |  1.914 | 3.456 | 6.629 | 4.932 | 6.649 |
| 23.0 |    5.723 |     1.55 |    4.989 | 7.458 |  2.753 |  1.994 | 3.542 | 6.302 | 4.612 | 6.376 |
| 24.0 |    5.773 |     1.66 |    5.403 | 7.168 |  2.818 |  2.079 | 3.634 | 5.969 | 4.298 | 6.143 |
| 25.0 |    5.693 |    1.769 |    5.735 | 6.771 |  2.871 |  2.161 | 3.703 | 5.608 | 4.001 | 5.869 |
| 26.0 |    5.574 |    1.914 |    6.017 | 6.385 |  2.909 |  2.239 | 3.728 |  5.27 | 3.713 | 5.651 |
| 27.0 |    5.456 |    2.057 |    6.332 | 6.042 |  2.946 |  2.307 | 3.774 | 4.957 | 3.443 | 5.456 |
| 28.0 |    5.324 |    2.215 |    6.539 |  5.74 |  2.979 |  2.372 | 3.806 | 4.698 | 3.236 | 5.388 |
| 29.0 |    5.179 |    2.329 |    6.547 | 5.491 |  3.006 |  2.431 | 3.816 | 4.492 | 3.094 | 5.297 |
| 30.0 |    5.002 |     2.37 |    6.606 | 5.215 |   3.03 |  2.487 | 3.828 | 4.292 | 2.942 |  5.25 |




#+name: vmean-plot
#+header: :var fn="04052012_4-0003-0030-0001.vstats" pltfile = "vmean.pdf"
#+header: :var phases="inm"
#+BEGIN_SRC python :return pltfile :results file 
  import matplotlib.pyplot as plt
  import numpy as np

  data = np.genfromtxt(open(fn), names=True)
  wstyles = {'vol': '-', 'mass': '--', "em_i": '-', "em_if": '-'}
  pstyles = {"i": "r", "n": "c", "m": "k", "em_i": "g", "em_if": "m"}
  for phase in phases:
      for weight in ['vol', 'mass']:
          name = '_'.join(['Vr', weight, phase])
          style = pstyles[phase] + wstyles[weight]
          plt.plot(data['Time'], data[name], style, label=name)
  for extra in "em_i", "em_if":
      name = '_'.join(['Vr', extra])
      style = pstyles[extra] + wstyles[extra]
      plt.plot(data['Time'], data[name], style, label=name)
  plt.legend(loc='lower right', ncol=len(phases)+1, fontsize='small')
  plt.xlabel('Time, kyr')
  plt.ylabel('Radial velocity, km/s')
  plt.savefig(pltfile)
#+END_SRC

#+RESULTS: vmean-plot
[[file:vmean.pdf]]


#+call: vmean-plot(fn="/Users/will/Work/Fabio/C2Ray/runs/pdrturb/out/Ostar-HD-0005-0355-0005.vstats", pltfile="vmean-test.pdf") :results file

#+RESULTS:
[[file:vmean-test.pdf]]

#+call: vmean-plot(fn="/Users/will/Work/Garrelt/garrelt-data/14112006_x.vstats", pltfile="vmean-test2.pdf", phases="in") :results file

#+RESULTS:
[[file:vmean-test2.pdf]]

#+BEGIN_SRC python :return data
  import numpy as np

  fn = "/Users/will/Work/Garrelt/garrelt-data/14112006_x.vstats"

  data = np.genfromtxt(open(fn), names=True).dtype.names
#+END_SRC

#+RESULTS:
| Time | Vr_vol_t | Vr_vol_n | Vr_vol_i | Vr_mass_t | Vr_mass_n | Vr_mass_i | Vr_em_t | Vr_em_n | Vr_em_i | Vr_em_if |

#+BEGIN_SRC python :return data
  import numpy as np

  fn = "/Users/will/Work/Garrelt/garrelt-data/14112006_x.vstats"

  data = np.genfromtxt(open(fn), names=True)
#+END_SRC

#+RESULTS:
|   1.0 | 0.01878 | 0.01878 | -0.0009183 |    -0.216 |    -0.216 | -0.0009183 |   -0.4827 |   -0.4831 | -0.0009183 | -0.0009183 |
|   2.0 | 0.01903 | 0.01903 |    -0.2576 |   -0.2134 |   -0.2135 |    -0.1484 |   -0.4301 |   -0.4424 |   -0.03498 |    0.09263 |
|   3.0 | 0.01927 | 0.01927 |      1.954 |   -0.2088 |   -0.2089 |      1.618 |   -0.3278 |    -0.328 |      1.696 |     0.9926 |
|   4.0 | 0.01949 | 0.01949 |     0.7425 |   -0.2011 |   -0.2021 |     0.6429 |   -0.1507 |   -0.1646 |     0.4937 |     0.7716 |
|   5.0 | 0.01969 | 0.01969 |     0.9096 |   -0.1945 |   -0.1953 |     0.6904 |  -0.04941 |  -0.05655 |     0.3676 |     0.7927 |
|   6.0 | 0.01988 | 0.01988 |       1.03 |   -0.1881 |   -0.1888 |       0.75 |   0.03155 |   0.02629 |     0.4635 |     0.9142 |
|   7.0 | 0.02007 | 0.02007 |      1.201 |   -0.1812 |    -0.182 |      0.921 |     0.107 |    0.1034 |     0.6995 |      1.036 |
|   8.0 | 0.02024 | 0.02024 |      1.347 |   -0.1744 |   -0.1751 |      1.154 |    0.1631 |    0.1602 |     0.9641 |      1.194 |
|   9.0 | 0.02042 | 0.02042 |      1.075 |   -0.1673 |   -0.1677 |      1.044 |    0.2106 |    0.2091 |     0.9937 |      1.308 |
|  10.0 | 0.02061 |  0.0206 |      1.689 |   -0.1594 |   -0.1601 |      1.603 |    0.2738 |    0.2718 |      1.155 |      1.928 |
|  11.0 |  0.0208 |  0.0208 |      1.415 |   -0.1509 |   -0.1511 |      0.626 |    0.3408 |    0.3408 |     0.3576 |     0.3442 |
|  12.0 | 0.02103 | 0.02102 |      2.507 |   -0.1431 |   -0.1433 |      1.403 |    0.3659 |    0.3659 |   -0.03358 |     0.5646 |
|  13.0 | 0.02128 | 0.02127 |      3.758 |   -0.1356 |   -0.1361 |      2.442 |    0.3718 |    0.3714 |      1.427 |     0.8576 |
|  14.0 | 0.02156 | 0.02155 |       4.62 |   -0.1284 |   -0.1296 |      2.658 |    0.3652 |    0.3631 |      1.402 |      1.651 |
|  15.0 | 0.02189 | 0.02186 |      5.248 |   -0.1214 |   -0.1229 |      3.211 |    0.3538 |     0.352 |      1.544 |      2.391 |
|  16.0 | 0.02225 | 0.02221 |      5.445 |   -0.1145 |    -0.116 |      3.469 |    0.3448 |    0.3431 |      1.267 |      1.881 |
|  17.0 | 0.02266 | 0.02261 |      5.304 |   -0.1079 |   -0.1095 |      3.845 |    0.3232 |    0.3217 |      1.619 |      2.538 |
|  18.0 | 0.02312 | 0.02306 |      5.777 |   -0.1011 |   -0.1028 |      4.542 |    0.2997 |    0.2989 |      3.268 |      3.605 |
|  19.0 | 0.02364 | 0.02357 |      5.381 |  -0.09449 |  -0.09627 |      4.251 |    0.2714 |    0.2704 |      3.042 |      2.531 |
|  20.0 | 0.02423 | 0.02416 |      5.239 |  -0.08785 |  -0.08962 |      4.049 |    0.2474 |    0.2465 |       2.98 |      2.272 |
|  21.0 |  0.0249 | 0.02482 |      5.096 |  -0.08152 |  -0.08326 |      3.851 |    0.2123 |    0.2115 |      2.827 |      2.229 |
|  22.0 | 0.02566 | 0.02556 |      5.316 |  -0.07541 |  -0.07727 |      3.841 |    0.1721 |    0.1714 |      2.636 |      2.402 |
|  23.0 | 0.02652 | 0.02638 |      5.684 |  -0.06922 |  -0.07135 |      3.919 |    0.1296 |    0.1288 |       2.52 |      1.864 |
|  24.0 | 0.02749 | 0.02728 |      6.451 |  -0.06297 |  -0.06569 |      4.469 |   0.09116 |   0.09021 |       3.13 |       2.53 |
|  25.0 | 0.02858 | 0.02823 |      7.954 |  -0.05677 |  -0.06029 |      4.904 |   0.05593 |   0.05469 |      2.263 |      1.809 |
|  26.0 | 0.02981 | 0.02933 |      8.828 |  -0.05072 |  -0.05484 |       5.48 |   0.02048 |    0.0195 |      3.153 |      2.382 |
|  27.0 | 0.03122 |  0.0307 |      8.311 |  -0.04478 |  -0.04884 |      5.149 |  -0.01767 |  -0.01851 |      3.161 |      2.179 |
|  28.0 |  0.0328 | 0.03225 |      7.682 |  -0.03881 |  -0.04276 |      4.714 |  -0.05424 |  -0.05515 |      2.959 |      2.448 |
|  29.0 | 0.03455 | 0.03387 |      7.872 |  -0.03284 |  -0.03706 |      4.672 |  -0.08993 |  -0.09086 |      2.956 |      2.539 |
|  30.0 |  0.0365 | 0.03549 |      8.842 |  -0.02686 |  -0.03187 |      5.052 |   -0.1222 |   -0.1232 |      3.111 |      2.385 |
|  31.0 | 0.03865 | 0.03719 |      9.751 |  -0.02093 |  -0.02697 |      5.472 |    -0.152 |    -0.153 |      3.245 |      2.408 |
|  32.0 | 0.04105 | 0.03892 |      10.82 |  -0.01504 |  -0.02254 |      6.085 |   -0.1799 |   -0.1809 |      3.442 |      2.631 |
|  33.0 | 0.04372 |  0.0409 |      11.53 | -0.009186 |  -0.01813 |      6.618 |   -0.2065 |   -0.2076 |       3.58 |      3.035 |
|  34.0 |  0.0467 | 0.04359 |       11.3 | -0.003287 |  -0.01302 |      6.721 |   -0.2316 |   -0.2328 |      3.706 |      3.017 |
|  35.0 | 0.04997 | 0.04658 |      10.72 |  0.002641 | -0.007512 |      6.538 |   -0.2535 |   -0.2547 |      3.682 |      3.189 |
|  36.0 | 0.05356 | 0.04958 |      10.45 |  0.008608 | -0.002086 |      6.348 |   -0.2712 |   -0.2725 |      3.665 |      3.009 |
|  37.0 | 0.05752 | 0.05261 |      10.64 |   0.01462 |   0.00283 |      6.443 |   -0.2861 |   -0.2873 |      3.683 |      2.992 |
|  38.0 | 0.06188 | 0.05567 |      11.14 |   0.02066 |  0.007184 |      6.764 |   -0.3018 |   -0.3031 |      3.745 |      3.155 |
|  39.0 | 0.06664 | 0.05917 |      11.55 |   0.02673 |   0.01188 |      6.987 |   -0.3182 |   -0.3195 |      3.785 |      3.534 |
|  40.0 |  0.0718 | 0.06265 |      10.55 |   0.03284 |    0.0166 |       7.13 |   -0.3331 |   -0.3344 |      3.872 |      3.688 |
|  41.0 | 0.07734 | 0.06606 |      8.046 |   0.03903 |   0.02127 |      7.177 |   -0.3439 |   -0.3454 |       3.93 |      3.637 |
|  42.0 | 0.08315 | 0.07015 |      6.243 |   0.04536 |   0.02626 |      7.085 |   -0.3518 |   -0.3533 |      3.917 |      3.574 |
|  43.0 | 0.08928 | 0.07457 |      5.207 |   0.05179 |   0.03122 |      7.018 |   -0.3591 |   -0.3605 |      3.967 |      3.684 |
|  44.0 | 0.09578 | 0.07858 |      4.472 |    0.0583 |   0.03582 |      7.015 |   -0.3669 |   -0.3683 |       4.03 |       3.89 |
|  45.0 |  0.1025 | 0.08291 |      4.174 |   0.06485 |   0.04052 |      7.013 |   -0.3757 |   -0.3772 |      4.139 |      4.193 |
|  46.0 |  0.1095 | 0.08689 |      4.134 |   0.07149 |   0.04515 |      7.052 |   -0.3831 |   -0.3847 |      4.206 |      4.372 |
|  47.0 |  0.1167 | 0.08982 |      4.265 |   0.07828 |   0.04958 |      7.132 |   -0.3882 |   -0.3899 |      4.221 |      4.164 |
|  48.0 |  0.1243 | 0.09241 |      4.427 |    0.0852 |   0.05391 |      7.173 |   -0.3912 |   -0.3928 |      4.212 |      4.216 |
|  49.0 |  0.1326 |  0.0964 |      4.417 |   0.09228 |   0.05873 |      7.114 |   -0.3948 |   -0.3965 |      4.269 |      4.462 |
|  51.0 |   0.151 |  0.1054 |      4.364 |    0.1111 |    0.0709 |      7.075 |    -0.408 |   -0.4097 |      4.504 |      4.953 |
|  52.0 |  0.1607 |  0.1078 |      4.464 |    0.1188 |   0.07531 |      7.144 |   -0.4126 |   -0.4143 |      4.605 |      4.809 |
|  53.0 |  0.1706 |  0.1095 |      4.592 |    0.1267 |   0.07987 |      7.221 |   -0.4153 |    -0.417 |      4.615 |      4.659 |
|  54.0 |  0.1808 |  0.1113 |      4.701 |    0.1347 |   0.08476 |      7.259 |    -0.418 |   -0.4197 |      4.583 |      4.898 |
|  55.0 |  0.1919 |  0.1138 |      4.762 |    0.1428 |   0.08971 |      7.279 |   -0.4203 |    -0.422 |      4.656 |       5.06 |
|  56.0 |  0.2043 |  0.1171 |      4.689 |    0.1509 |   0.09484 |      7.266 |   -0.4231 |    -0.425 |      4.739 |      5.177 |
|  57.0 |  0.2171 |  0.1216 |      4.604 |    0.1593 |    0.1002 |      7.254 |   -0.4254 |   -0.4273 |      4.834 |      5.199 |
|  58.0 |  0.2311 |  0.1276 |      4.572 |    0.1677 |    0.1056 |      7.246 |   -0.4272 |   -0.4291 |      4.873 |      5.142 |
|  59.0 |  0.2461 |  0.1347 |      4.581 |    0.1763 |    0.1115 |      7.249 |    -0.428 |     -0.43 |      4.901 |      5.105 |
|  60.0 |  0.2622 |  0.1426 |      4.604 |    0.1849 |    0.1176 |      7.249 |   -0.4288 |   -0.4307 |      4.927 |      5.149 |
|  61.0 |  0.2782 |  0.1517 |      4.614 |    0.1935 |     0.124 |      7.227 |     -0.43 |    -0.432 |       4.94 |      5.329 |
|  62.0 |  0.2948 |  0.1614 |      4.606 |    0.2023 |    0.1306 |      7.198 |   -0.4314 |   -0.4334 |       4.99 |      5.371 |
|  63.0 |   0.312 |  0.1718 |      4.554 |    0.2112 |    0.1373 |      7.173 |   -0.4316 |   -0.4336 |      5.028 |       5.12 |
|  64.0 |  0.3302 |  0.1824 |      4.462 |    0.2201 |    0.1439 |      7.167 |   -0.4312 |   -0.4333 |      5.061 |      4.875 |
|  65.0 |  0.3495 |   0.193 |      4.364 |    0.2291 |    0.1503 |      7.176 |   -0.4306 |   -0.4326 |      5.069 |      5.067 |
|  66.0 |  0.3701 |  0.2034 |      4.302 |    0.2382 |    0.1567 |      7.189 |   -0.4301 |   -0.4321 |      5.096 |      5.216 |
|  67.0 |  0.3922 |  0.2144 |       4.27 |    0.2474 |    0.1631 |      7.193 |     -0.43 |   -0.4321 |      5.141 |      5.299 |
|  68.0 |  0.4158 |  0.2258 |      4.272 |    0.2567 |    0.1697 |      7.192 |   -0.4284 |   -0.4305 |      5.175 |      5.095 |
|  69.0 |  0.4407 |  0.2372 |      4.293 |    0.2661 |    0.1763 |      7.185 |   -0.4265 |   -0.4286 |      5.196 |      5.146 |
|  70.0 |  0.4661 |  0.2489 |      4.316 |    0.2755 |    0.1831 |      7.163 |   -0.4246 |   -0.4267 |      5.219 |      5.207 |
|  71.0 |  0.4921 |  0.2613 |      4.335 |    0.2851 |    0.1901 |       7.12 |   -0.4224 |   -0.4246 |      5.232 |      5.283 |
|  72.0 |  0.5167 |   0.275 |      4.339 |     0.295 |    0.1972 |      7.055 |     -0.42 |   -0.4222 |      5.238 |      5.152 |
|  73.0 |  0.5442 |  0.2906 |      4.324 |    0.3045 |    0.2046 |      6.978 |   -0.4168 |    -0.419 |      5.236 |      5.109 |
|  74.0 |  0.5728 |  0.3082 |       4.31 |    0.3143 |    0.2122 |        6.9 |   -0.4132 |   -0.4154 |      5.233 |      5.169 |
|  75.0 |  0.6029 |  0.3274 |      4.296 |    0.3242 |    0.2199 |      6.825 |   -0.4096 |   -0.4118 |      5.256 |      5.305 |
|  76.0 |  0.6343 |  0.3481 |      4.274 |    0.3341 |    0.2275 |       6.75 |   -0.4065 |   -0.4087 |      5.297 |       5.21 |
|  77.0 |   0.667 |  0.3699 |      4.247 |    0.3441 |    0.2352 |      6.672 |   -0.4035 |   -0.4057 |      5.327 |      5.147 |
|  78.0 |  0.7008 |  0.3922 |      4.234 |    0.3541 |    0.2428 |      6.605 |      -0.4 |   -0.4022 |       5.35 |      5.073 |
|  79.0 |  0.7357 |  0.4141 |      4.237 |    0.3643 |    0.2502 |      6.554 |   -0.3958 |   -0.3981 |      5.376 |      5.169 |
|  80.0 |  0.7717 |  0.4356 |      4.255 |    0.3746 |    0.2574 |      6.516 |   -0.3913 |   -0.3937 |      5.417 |      5.185 |
|  81.0 |  0.8081 |  0.4571 |      4.281 |     0.385 |    0.2648 |      6.481 |   -0.3869 |   -0.3893 |      5.458 |      5.261 |
|  82.0 |  0.8448 |  0.4787 |      4.308 |    0.3954 |    0.2723 |      6.447 |   -0.3826 |    -0.385 |      5.494 |      5.181 |
|  83.0 |  0.8814 |  0.5005 |      4.334 |    0.4058 |    0.2798 |      6.412 |   -0.3784 |   -0.3808 |       5.53 |      5.111 |
|  84.0 |  0.9178 |  0.5225 |      4.359 |    0.4163 |    0.2876 |      6.374 |   -0.3742 |   -0.3766 |      5.557 |      5.201 |
|  85.0 |  0.9543 |  0.5443 |      4.386 |    0.4269 |    0.2956 |      6.337 |   -0.3701 |   -0.3725 |      5.577 |      5.273 |
|  86.0 |  0.9918 |  0.5638 |      4.421 |    0.4377 |    0.3035 |      6.302 |   -0.3661 |   -0.3686 |      5.604 |      5.296 |
|  87.0 |   1.029 |  0.5844 |      4.458 |    0.4486 |    0.3114 |       6.27 |   -0.3624 |   -0.3649 |      5.634 |      5.171 |
|  88.0 |   1.065 |   0.604 |      4.496 |    0.4596 |    0.3197 |      6.235 |   -0.3585 |    -0.361 |      5.649 |      5.248 |
|  89.0 |   1.102 |  0.6235 |      4.531 |    0.4706 |     0.328 |      6.206 |   -0.3547 |   -0.3572 |      5.655 |      5.249 |
|  90.0 |   1.138 |  0.6434 |      4.567 |     0.482 |    0.3366 |      6.174 |   -0.3499 |   -0.3524 |       5.67 |      5.114 |
|  91.0 |   1.175 |  0.6635 |      4.603 |    0.4933 |    0.3453 |      6.142 |   -0.3453 |   -0.3478 |      5.677 |      5.263 |
|  92.0 |   1.211 |  0.6846 |      4.635 |    0.5045 |    0.3541 |      6.113 |   -0.3412 |   -0.3438 |      5.684 |      5.236 |
|  93.0 |   1.248 |   0.706 |      4.668 |     0.516 |     0.363 |      6.089 |   -0.3381 |   -0.3407 |      5.684 |      5.255 |
|  94.0 |   1.284 |  0.7269 |      4.705 |    0.5275 |    0.3718 |       6.07 |   -0.3348 |   -0.3374 |      5.687 |      5.293 |
|  95.0 |   1.321 |  0.7473 |      4.743 |    0.5392 |    0.3805 |      6.055 |    -0.331 |   -0.3336 |      5.687 |      5.201 |
|  96.0 |   1.357 |  0.7676 |      4.785 |    0.5509 |    0.3895 |      6.041 |   -0.3274 |   -0.3301 |      5.685 |      5.343 |
|  97.0 |   1.393 |  0.7887 |       4.82 |    0.5628 |    0.3986 |      6.026 |   -0.3241 |   -0.3267 |      5.691 |      5.381 |
|  98.0 |   1.429 |    0.81 |      4.853 |    0.5752 |    0.4077 |      6.011 |   -0.3209 |   -0.3236 |      5.704 |      5.328 |
|  99.0 |   1.466 |  0.8313 |      4.884 |    0.5868 |    0.4168 |      5.996 |   -0.3171 |   -0.3198 |      5.708 |      5.121 |
| 100.0 |   1.502 |  0.8538 |      4.912 |    0.5986 |    0.4261 |      5.985 |   -0.3131 |   -0.3157 |      5.705 |      5.299 |
| 101.0 |   1.538 |   0.877 |      4.939 |    0.6104 |    0.4354 |      5.977 |   -0.3092 |   -0.3118 |      5.701 |      5.177 |
| 102.0 |   1.575 |  0.9011 |      4.972 |    0.6222 |    0.4449 |      5.974 |   -0.3054 |   -0.3081 |      5.693 |      5.163 |
| 103.0 |   1.612 |  0.9257 |      5.009 |    0.6341 |    0.4544 |      5.972 |   -0.3009 |   -0.3036 |      5.686 |      5.088 |
| 104.0 |   1.649 |  0.9501 |      5.049 |     0.646 |    0.4638 |      5.973 |   -0.2966 |   -0.2992 |      5.677 |      5.262 |
| 105.0 |   1.687 |  0.9739 |      5.091 |     0.658 |    0.4733 |      5.973 |   -0.2928 |   -0.2954 |      5.673 |      5.398 |
| 106.0 |   1.726 |  0.9979 |      5.133 |    0.6699 |    0.4828 |      5.975 |   -0.2892 |   -0.2918 |      5.674 |      5.387 |
| 107.0 |   1.765 |   1.022 |      5.176 |    0.6818 |    0.4923 |       5.98 |   -0.2853 |   -0.2879 |       5.68 |      5.229 |
| 108.0 |   1.804 |   1.045 |      5.224 |    0.6938 |    0.5016 |      5.988 |   -0.2812 |   -0.2837 |      5.684 |      5.334 |
| 109.0 |   1.845 |   1.069 |      5.272 |    0.7058 |     0.511 |      5.996 |   -0.2776 |   -0.2801 |      5.685 |      5.374 |
| 110.0 |   1.886 |   1.093 |       5.32 |    0.7178 |    0.5206 |      6.002 |   -0.2745 |    -0.277 |      5.678 |      5.458 |
| 111.0 |   1.927 |   1.116 |      5.371 |    0.7301 |      0.53 |      6.011 |   -0.2711 |   -0.2736 |       5.68 |      5.416 |
| 112.0 |    1.97 |   1.139 |      5.423 |    0.7422 |    0.5396 |      6.021 |   -0.2666 |    -0.269 |       5.68 |      5.399 |
| 113.0 |     2.0 |   1.162 |      5.473 |    0.7544 |     0.549 |      6.032 |   -0.2617 |   -0.2641 |      5.675 |      5.472 |
| 114.0 |   2.047 |   1.185 |      5.523 |    0.7667 |    0.5584 |      6.043 |   -0.2569 |   -0.2594 |      5.672 |      5.484 |
| 115.0 |   2.092 |    1.21 |      5.572 |    0.7791 |    0.5679 |      6.062 |   -0.2524 |   -0.2548 |      5.673 |      5.533 |
| 116.0 |   2.135 |   1.235 |      5.611 |    0.7914 |    0.5774 |      6.073 |   -0.2478 |   -0.2502 |      5.675 |      5.593 |
| 117.0 |   2.178 |   1.263 |      5.642 |    0.8038 |    0.5871 |       6.08 |   -0.2433 |   -0.2457 |      5.681 |      5.634 |
| 118.0 |   2.222 |   1.291 |      5.669 |    0.8163 |    0.5965 |      6.084 |   -0.2391 |   -0.2415 |      5.684 |       5.59 |
| 119.0 |   2.265 |   1.322 |      5.696 |    0.8289 |    0.6064 |       6.09 |   -0.2348 |   -0.2371 |      5.681 |      5.504 |
| 120.0 |   2.309 |   1.349 |       5.73 |    0.8413 |    0.6161 |        6.1 |     -0.23 |   -0.2324 |      5.672 |      5.582 |
| 121.0 |   2.354 |   1.376 |      5.769 |    0.8537 |    0.6257 |      6.114 |   -0.2254 |   -0.2278 |      5.672 |      5.666 |
| 122.0 |   2.398 |   1.403 |       5.81 |    0.8662 |    0.6353 |      6.132 |   -0.2213 |   -0.2236 |      5.679 |      5.593 |
| 123.0 |   2.443 |   1.429 |      5.851 |    0.8785 |    0.6447 |      6.149 |   -0.2168 |   -0.2191 |      5.684 |      5.524 |
| 124.0 |   2.487 |   1.455 |       5.89 |    0.8907 |    0.6542 |      6.162 |   -0.2122 |   -0.2144 |      5.684 |      5.591 |
| 125.0 |    2.53 |   1.483 |      5.924 |     0.903 |    0.6638 |      6.172 |   -0.2077 |     -0.21 |      5.682 |      5.512 |
| 126.0 |   2.572 |   1.511 |      5.951 |    0.9153 |    0.6736 |      6.179 |    -0.204 |   -0.2063 |      5.675 |      5.674 |
| 127.0 |   2.614 |    1.54 |      5.972 |    0.9277 |    0.6835 |      6.184 |   -0.2007 |    -0.203 |      5.671 |      5.756 |
| 128.0 |   2.656 |   1.568 |      5.992 |    0.9398 |    0.6934 |      6.188 |   -0.1975 |   -0.1998 |      5.669 |      5.739 |
| 129.0 |   2.697 |   1.596 |      6.011 |     0.952 |    0.7031 |       6.19 |   -0.1942 |   -0.1964 |      5.661 |      5.655 |
| 130.0 |   2.739 |   1.624 |      6.033 |    0.9642 |    0.7127 |      6.193 |   -0.1906 |   -0.1928 |      5.653 |      5.669 |
| 131.0 |   2.779 |   1.651 |      6.057 |    0.9763 |    0.7221 |      6.196 |   -0.1869 |   -0.1891 |      5.643 |      5.699 |
| 132.0 |    2.82 |   1.677 |      6.084 |    0.9883 |    0.7316 |      6.198 |    -0.183 |   -0.1852 |      5.633 |      5.686 |
| 133.0 |    2.86 |   1.703 |      6.111 |       1.0 |    0.7411 |        6.2 |   -0.1785 |   -0.1807 |      5.621 |      5.564 |
| 134.0 |     2.9 |   1.728 |      6.138 |     1.012 |    0.7506 |      6.199 |   -0.1738 |    -0.176 |      5.601 |      5.629 |
| 135.0 |   2.939 |   1.753 |      6.165 |     1.024 |      0.76 |      6.197 |   -0.1691 |   -0.1712 |      5.581 |      5.634 |
| 136.0 |   2.977 |   1.776 |      6.192 |     1.035 |    0.7695 |      6.195 |   -0.1643 |   -0.1664 |      5.562 |      5.572 |
| 137.0 |   3.015 |   1.799 |      6.222 |     1.047 |    0.7789 |      6.195 |   -0.1596 |   -0.1617 |      5.541 |      5.577 |
| 138.0 |   3.052 |   1.821 |       6.25 |     1.058 |    0.7881 |      6.193 |   -0.1551 |   -0.1572 |      5.525 |      5.597 |
| 139.0 |   3.088 |   1.841 |      6.277 |      1.07 |     0.797 |      6.192 |   -0.1507 |   -0.1528 |      5.512 |      5.573 |
| 140.0 |   3.123 |   1.861 |      6.303 |     1.081 |    0.8057 |      6.192 |   -0.1464 |   -0.1486 |        5.5 |       5.52 |
| 141.0 |   3.156 |    1.88 |      6.328 |     1.092 |    0.8144 |      6.183 |   -0.1424 |   -0.1446 |      5.481 |      5.529 |
| 142.0 |   3.188 |   1.899 |       6.35 |     1.103 |    0.8233 |       6.17 |   -0.1388 |    -0.141 |       5.46 |      5.538 |
| 143.0 |    3.22 |   1.918 |      6.368 |     1.113 |    0.8321 |       6.16 |   -0.1352 |   -0.1374 |      5.435 |      5.505 |
| 144.0 |   3.249 |   1.935 |      6.383 |     1.124 |    0.8411 |      6.147 |   -0.1318 |    -0.134 |      5.406 |      5.486 |
| 145.0 |   3.278 |   1.953 |      6.393 |     1.134 |      0.85 |      6.132 |   -0.1288 |    -0.131 |      5.373 |      5.485 |
| 146.0 |   3.306 |   1.972 |        6.4 |     1.145 |    0.8591 |      6.111 |   -0.1264 |   -0.1286 |      5.341 |      5.495 |
| 147.0 |   3.332 |    1.99 |      6.405 |     1.155 |    0.8679 |       6.09 |   -0.1241 |   -0.1263 |      5.311 |      5.463 |
| 148.0 |   3.358 |   2.007 |      6.408 |     1.164 |    0.8763 |       6.07 |   -0.1222 |   -0.1244 |      5.278 |      5.425 |
| 149.0 |   3.382 |   2.024 |      6.409 |     1.172 |    0.8847 |      6.045 |   -0.1205 |   -0.1227 |      5.243 |       5.39 |
| 150.0 |   3.407 |    2.04 |      6.406 |      1.18 |    0.8926 |      6.019 |    -0.119 |   -0.1213 |      5.203 |      5.287 |
| 151.0 |    3.43 |   2.056 |        6.4 |     1.188 |    0.9006 |      5.991 |   -0.1179 |   -0.1201 |      5.158 |       5.28 |
| 152.0 |   3.451 |   2.073 |      6.388 |     1.196 |    0.9084 |      5.963 |   -0.1166 |   -0.1189 |      5.114 |      5.258 |
| 153.0 |   3.471 |   2.093 |      6.369 |     1.204 |    0.9165 |      5.931 |   -0.1153 |   -0.1175 |      5.073 |      5.208 |
| 154.0 |   3.491 |   2.117 |      6.341 |     1.212 |    0.9249 |      5.896 |   -0.1141 |   -0.1162 |      5.032 |      5.206 |
| 155.0 |   3.511 |   2.145 |      6.308 |      1.22 |    0.9333 |       5.86 |   -0.1128 |   -0.1148 |      4.991 |      5.105 |
| 156.0 |   3.529 |   2.176 |      6.268 |     1.228 |    0.9422 |      5.818 |   -0.1113 |   -0.1134 |      4.945 |      5.043 |
| 157.0 |   3.547 |   2.209 |      6.222 |     1.236 |    0.9509 |      5.774 |   -0.1096 |   -0.1117 |      4.898 |      5.039 |
| 158.0 |   3.564 |   2.244 |      6.171 |     1.244 |    0.9601 |      5.728 |   -0.1079 |   -0.1099 |      4.848 |      5.017 |
| 159.0 |   3.579 |    2.28 |      6.119 |     1.252 |    0.9692 |       5.68 |   -0.1063 |   -0.1083 |        4.8 |      4.946 |
| 160.0 |   3.593 |   2.315 |      6.069 |      1.26 |    0.9785 |      5.634 |   -0.1048 |   -0.1068 |      4.754 |      4.923 |
| 161.0 |   3.606 |   2.349 |       6.02 |     1.268 |    0.9875 |      5.587 |   -0.1033 |   -0.1053 |      4.706 |      4.905 |
| 162.0 |   3.618 |   2.383 |      5.971 |     1.275 |    0.9962 |      5.538 |   -0.1017 |   -0.1037 |      4.656 |      4.873 |
| 163.0 |   3.629 |   2.416 |       5.92 |     1.281 |     1.005 |      5.489 |   -0.1002 |   -0.1022 |      4.605 |      4.808 |
| 164.0 |   3.638 |   2.448 |      5.865 |     1.288 |     1.013 |      5.441 |  -0.09894 |   -0.1009 |      4.552 |      4.806 |
| 165.0 |   3.648 |   2.482 |       5.81 |     1.293 |     1.022 |      5.385 |  -0.09783 |  -0.09975 |        4.5 |      4.802 |
| 166.0 |   3.656 |   2.515 |      5.753 |     1.299 |     1.029 |       5.33 |  -0.09676 |   -0.0987 |      4.451 |      4.785 |
| 167.0 |   3.664 |   2.548 |      5.695 |     1.304 |     1.037 |      5.279 |  -0.09567 |   -0.0976 |      4.404 |      4.711 |
| 168.0 |    3.67 |   2.579 |      5.638 |     1.309 |     1.043 |      5.227 |  -0.09452 |  -0.09644 |      4.356 |      4.669 |
| 169.0 |   3.676 |   2.608 |      5.581 |     1.313 |     1.049 |      5.176 |  -0.09336 |  -0.09526 |       4.31 |      4.696 |
| 170.0 |    3.68 |   2.635 |      5.526 |     1.316 |     1.054 |      5.128 |  -0.09223 |  -0.09411 |      4.269 |      4.687 |
| 171.0 |   3.683 |   2.659 |      5.473 |     1.319 |     1.059 |       5.08 |   -0.0912 |   -0.0931 |      4.228 |      4.619 |
| 172.0 |   3.685 |   2.682 |       5.42 |     1.321 |     1.063 |       5.03 |  -0.09023 |   -0.0921 |      4.185 |      4.562 |
| 173.0 |   3.686 |   2.704 |      5.367 |     1.323 |     1.066 |       4.98 |  -0.08895 |  -0.09079 |      4.136 |      4.541 |
| 174.0 |   3.686 |   2.726 |      5.315 |     1.325 |     1.069 |      4.929 |  -0.08758 |  -0.08939 |      4.089 |      4.512 |
| 175.0 |   3.686 |   2.748 |      5.262 |     1.325 |     1.071 |      4.879 |  -0.08623 |  -0.08804 |      4.044 |      4.438 |
| 176.0 |   3.684 |    2.77 |      5.206 |     1.326 |     1.074 |      4.828 |  -0.08481 |   -0.0866 |      3.998 |      4.391 |
| 177.0 |   3.682 |   2.793 |      5.147 |     1.327 |     1.077 |      4.774 |  -0.08318 |  -0.08493 |      3.953 |      4.347 |
| 178.0 |   3.678 |   2.816 |      5.088 |     1.328 |      1.08 |      4.723 |  -0.08149 |  -0.08323 |      3.909 |      4.296 |
| 179.0 |   3.674 |   2.838 |      5.029 |     1.329 |     1.083 |      4.673 |  -0.07983 |  -0.08155 |      3.865 |      4.236 |
| 180.0 |   3.669 |   2.857 |      4.972 |      1.33 |     1.087 |      4.622 |  -0.07804 |  -0.07974 |      3.818 |      4.229 |
| 181.0 |   3.663 |   2.875 |      4.918 |     1.332 |      1.09 |      4.574 |  -0.07602 |  -0.07771 |      3.777 |      4.189 |
| 182.0 |   3.656 |   2.891 |      4.867 |     1.334 |     1.094 |      4.527 |  -0.07376 |  -0.07543 |       3.74 |      4.127 |
| 183.0 |   3.649 |   2.905 |      4.817 |     1.336 |     1.098 |      4.483 |  -0.07138 |  -0.07305 |      3.703 |      4.083 |
| 184.0 |   3.641 |   2.919 |      4.769 |     1.339 |     1.102 |      4.441 |  -0.06887 |  -0.07053 |      3.662 |      4.058 |
| 185.0 |   3.633 |   2.932 |       4.72 |     1.342 |     1.107 |      4.398 |  -0.06618 |   -0.0679 |      3.622 |      4.038 |
| 186.0 |   3.626 |   2.945 |      4.672 |     1.345 |     1.111 |      4.357 |  -0.06352 |  -0.06522 |      3.584 |      3.994 |
| 187.0 |   3.617 |   2.958 |      4.623 |     1.348 |     1.116 |      4.316 |  -0.06086 |  -0.06252 |      3.547 |      3.976 |
| 188.0 |   3.609 |   2.971 |      4.573 |     1.351 |     1.121 |      4.274 |  -0.05823 |  -0.05985 |      3.512 |       3.95 |
| 189.0 |   3.599 |   2.985 |      4.523 |     1.354 |     1.125 |       4.23 |  -0.05564 |  -0.05725 |      3.474 |      3.918 |
| 190.0 |    3.59 |   2.998 |      4.473 |     1.358 |      1.13 |      4.187 |    -0.053 |  -0.05461 |      3.436 |      3.871 |
| 191.0 |   3.582 |   3.011 |      4.425 |     1.361 |     1.135 |      4.145 |  -0.05033 |  -0.05192 |      3.398 |      3.861 |
| 192.0 |   3.573 |   3.024 |       4.38 |     1.364 |      1.14 |      4.105 |  -0.04784 |  -0.04943 |      3.364 |      3.839 |
| 193.0 |   3.565 |   3.037 |      4.336 |     1.367 |     1.144 |      4.068 |  -0.04544 |    -0.047 |      3.331 |      3.808 |
| 194.0 |   3.557 |   3.051 |      4.292 |     1.369 |     1.149 |       4.03 |  -0.04304 |   -0.0446 |      3.297 |      3.788 |
| 195.0 |    3.55 |   3.066 |      4.247 |     1.372 |     1.153 |      3.991 |  -0.04043 |  -0.04194 |      3.263 |      3.782 |
| 196.0 |   3.542 |   3.081 |        4.2 |     1.374 |     1.157 |      3.952 |  -0.03773 |  -0.03924 |      3.231 |      3.741 |
| 197.0 |   3.535 |   3.095 |      4.156 |     1.377 |     1.162 |      3.914 |  -0.03505 |  -0.03658 |      3.198 |      3.713 |
| 198.0 |   3.528 |    3.11 |      4.111 |      1.38 |     1.166 |      3.876 |  -0.03233 |  -0.03386 |      3.166 |      3.682 |
| 199.0 |   3.521 |   3.126 |      4.068 |     1.383 |      1.17 |       3.84 |  -0.02975 |  -0.03124 |      3.132 |      3.669 |
| 200.0 |   3.515 |   3.142 |      4.026 |     1.385 |     1.175 |      3.804 |  -0.02723 |  -0.02872 |      3.101 |      3.656 |
| 201.0 |   3.508 |   3.158 |      3.984 |     1.388 |     1.179 |      3.769 |   -0.0247 |  -0.02615 |      3.071 |      3.632 |
| 202.0 |   3.502 |   3.173 |      3.945 |      1.39 |     1.183 |      3.734 |  -0.02222 |  -0.02367 |       3.04 |       3.61 |
| 203.0 |   3.495 |   3.187 |      3.907 |     1.393 |     1.187 |      3.699 |  -0.01968 |  -0.02111 |      3.007 |      3.614 |
| 204.0 |   3.489 |   3.199 |      3.873 |     1.395 |     1.191 |      3.665 |  -0.01708 |  -0.01852 |      2.975 |      3.585 |
| 205.0 |   3.483 |   3.209 |       3.84 |     1.397 |     1.195 |      3.631 |  -0.01436 |  -0.01578 |      2.944 |      3.567 |
| 206.0 |   3.478 |   3.217 |      3.811 |       1.4 |     1.199 |      3.598 |  -0.01173 |  -0.01315 |      2.915 |      3.572 |
| 207.0 |   3.472 |   3.223 |      3.784 |     1.402 |     1.203 |      3.568 | -0.009236 |  -0.01065 |      2.889 |      3.568 |
| 208.0 |   3.466 |   3.229 |      3.759 |     1.404 |     1.207 |      3.539 | -0.006679 | -0.008113 |      2.864 |      3.536 |
| 209.0 |    3.46 |   3.234 |      3.735 |     1.406 |     1.211 |      3.511 | -0.003924 | -0.005356 |      2.837 |      3.534 |



*** New tables of structure function slopes
+ These have changed slightly since the previous draft
+ We only use times after 200,00 years
| Time        | 200,000 |      |      | 250,000 |      |      | 300,000 |      |      |               |
| Plane       |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z | AVERAGE       |
|-------------+---------+------+------+---------+------+------+---------+------+------+---------------|
| Hα          |    0.61 | 0.49 | 0.55 |    0.71 | 0.49 | 0.47 |    0.82 | 0.53 | 0.62 | 0.59 +/- 0.04 |
| [OIII]λ5007 |    0.68 | 0.77 | 0.70 |    0.83 | 0.71 | 0.57 |    1.02 | 0.61 | 0.73 | 0.74 +/- 0.04 |
| [NII]λ6584  |    0.53 | 0.38 | 0.45 |    0.61 | 0.43 | 0.41 |    0.65 | 0.53 | 0.44 | 0.49 +/- 0.03 |
| [SII]λ6716  |    0.39 | 0.28 | 0.32 |    0.39 | 0.28 | 0.26 |    0.40 | 0.41 | 0.26 | 0.33 +/- 0.02 |
#+TBLFM: $11=vmeane($2..$10); f2

**** DONE Mung all data into a big table
CLOSED: [2014-07-23 Wed 17:28]

#+name: extract-table
#+BEGIN_SRC python :return tab :results verbatim
  import json
  import numpy as np
  from astropy.table import Table

  views = ['xy', 'xz', 'yz']
  ions = ['halp', 'oiii', 'niix', 'siix', 'vion']
  lines = ['Halpha', 'O35007', 'N26584', 'S26716']

  binids = {'t': 'n032', 'T': 'n001'}

  results = {}
  columns = []
  for ion in ions:
      datafile = 'Power-Indices/3D/04052012_4_sp-{}-allfit.dat'.format(ion)
      times, k3d = np.loadtxt(datafile, usecols=(0, 4), unpack=True)
      if 't' in results:
          assert np.alltrue(times == results['t'])
      else:
          results['t'] = times
          columns.append('t')
      klabel = "_".join(['k3', ion[0].upper()])
      results[klabel] = k3d - 2.0
      columns.append(klabel)

  for ion, line in zip(ions[:-1], lines):
      for view in views:
          for tT, binid in binids.items():
              datafile = 'Power-Indices/' \
                         '{}/04052012_4_-sp-{}y-{}' \
                         'kfit-tab.dat'.format(view, binid, line)
              times, kvca = np.loadtxt(datafile, usecols=(0, 2), unpack=True)
              assert np.alltrue(times == results['t'])
              klabel = "".join(['kv', ion[0].upper(), tT, view])
              results[klabel] = kvca
              columns.append(klabel)

          datafile = 'Power-Indices/{}/04052012_4_{}-sfallfit.dat'.format(view, line)
          times, ksf = np.loadtxt(datafile, usecols=(0, 2), unpack=True)
          klabel = "".join(['ks', ion[0].upper(), view])
          results[klabel] = ksf
          columns.append(klabel)

  tab = Table(data=results, names=columns)
  tab.write('power-indices-vs-time.tab', format='ascii.tab')

#+END_SRC

#+RESULTS: extract-table
#+begin_example
 t     k3_H    k3_O    k3_N    k3_S  ... ksSxz    kvStyz    kvSTyz  ksSyz 
---- ------- ------- ------- ------- ... ------ --------- --------- ------
10.0 -3.5542 -3.8993 -2.4411 -2.3671 ... 0.4012  -1.90324 -1.993975 0.4523
11.0 -3.6413 -4.1279 -2.5538 -2.4154 ... 0.3447 -1.898838 -2.025668 0.4785
12.0 -3.3278 -3.8197 -2.5536 -2.4609 ... 0.3583 -1.954415 -2.120802 0.4667
13.0 -3.2569 -3.7877 -2.6925   -2.57 ... 0.3003 -1.810293  -1.96001 0.5195
14.0 -3.1404  -3.681 -2.7998 -2.6637 ... 0.2453 -1.737539 -1.923827 0.4134
15.0 -3.0544 -3.5216 -2.7767 -2.6313 ... 0.2633 -1.690619 -1.849246 0.4497
16.0 -3.0108 -3.4642 -2.7482 -2.6072 ...  0.255  -1.72312 -1.939087 0.4121
17.0 -3.0198  -3.483 -2.7795  -2.626 ... 0.2803 -1.692221  -1.85228 0.3539
18.0 -2.9295 -3.4211 -2.7144 -2.5929 ... 0.2899 -1.666025 -1.841816 0.3447
19.0 -2.8438 -3.3775 -2.6606 -2.5758 ... 0.2955  -1.67981 -1.806665 0.3359
20.0 -2.8162 -3.3462 -2.6547 -2.5706 ... 0.2774 -1.702789 -1.847767 0.3186
21.0 -2.8399 -3.3769 -2.6508 -2.5658 ... 0.2666 -1.704195 -1.844396 0.3056
22.0 -2.8374 -3.3242 -2.6624 -2.5775 ... 0.2224  -1.76931 -1.925681 0.2929
23.0 -2.8771 -3.3222 -2.6754 -2.5863 ... 0.2362  -1.76314 -1.933978 0.2755
24.0 -2.8784 -3.3163 -2.6901 -2.5963 ... 0.2657 -1.806039 -1.956009 0.2766
25.0 -2.8875  -3.294 -2.6855 -2.5741 ... 0.2781 -1.810989  -1.97014 0.2629
26.0 -2.9189 -3.3506 -2.7039 -2.5979 ...  0.292 -1.845024 -2.020894 0.2473
27.0 -2.9292 -3.3588 -2.7179 -2.6187 ... 0.2992 -1.839533 -1.991121 0.2482
28.0 -2.9401 -3.3405 -2.7153 -2.6051 ... 0.3253 -1.851696 -2.000542 0.2457
29.0 -2.9365 -3.3574  -2.727 -2.6234 ... 0.3763 -1.841143 -1.995638 0.2413
30.0 -2.9371 -3.2956 -2.7483 -2.6488 ...  0.409 -1.816146 -1.980373 0.2581
#+end_example
**** Plot for the thin VCA

#+BEGIN_SRC python :return pltfile :results file 
<<power-indices-plot-setup>>
tcut = 17.0

fig, axes = plt.subplots(2, 2, sharex=True)
plt.setp(axes.flat, aspect=1.0, adjustable='box-forced')
kmin, kmax = -3.8+0.01, -2.8-0.01
pltfile = 'vca-thin-vs-3d-panels.pdf'
statsfile = pltfile.replace(".pdf", ".stats")
f = open(statsfile, "w")
for ion, ax in zip('OHNS', axes.flat):
    # if ion == 'H':
    #     continue
    k3 = tab['k3_V']
    m = tab['t'] >= tcut
    mm = tab['t'] <= tcut

    if ion in 'O':
        ax.plot([kmin, kmax], [-4.5 - 0.5*kmin, -4.5 - 0.5*kmax], '-k')
        ymin, ymax = kmin+0.5, kmax+0.5
    else:
        ax.plot([kmin, kmax], [-1.5 - 0.5*kmin, -1.5 - 0.5*kmax], '-k')
        ymin, ymax = kmin+3.5, kmax+3.5

    ax.set_xlim(kmin, kmax)
    ax.set_ylim(ymin, ymax)

    for view in ['xy', 'xz', 'yz']:
        kthick = tab['kv' + ion + 'T' + view]
        kthin = tab['kv' + ion + 't' + view]
        <<power-indices-plot-kwds>>
        kplot = kthin if ion in 'O' else kthin - kthick
        ax.plot(k3[mm], kplot[mm], alpha=0.2, label=None, **plt_kwds)
        ax.plot(k3[m], kplot[m], alpha=0.6,
                 label=linedict[ion] + ' ' + view,  **plt_kwds)
        print(ion, view, kplot[m].mean(), '+/-', kplot[m].std(), file=f)
    ax.vlines(-11./3., -100, 100, alpha=0.2, lw=3)
    ax.annotate(r'$n = -11/3$', (-11/3, ymax-0.15), rotation="vertical", **labelprops)
    if ion in 'O':
        ax.annotate(r'$\gamma_{\mathrm{t}} = -4.5 - 0.5 n$', (-3.5, -4.5 - 0.5*(-3.5)),  rotation=-26.56, **labelprops)
    else:
        ax.annotate(r'$\gamma_{\mathrm{t}} - \gamma_{\mathrm{T}}= -1.5 - 0.5 n$', (-3.5, -1.5 - 0.5*(-3.5)),  rotation=-26.56, **labelprops)
    ax.legend(loc='upper right', fontsize='small', ncol=1)
    ax.grid()

f.close()
     
for ax in axes[-1, :]:
    ax.set_xlabel(r'Power law index of 3D velocity, $n$', fontsize='small')
for ax in axes[0, 0], :
    ax.set_ylabel(r'VCA power law index for thin slice: $\gamma_\mathrm{t}$', fontsize='small')
for ax in axes[:, 1]:
    ax.yaxis.tick_right()
    ax.yaxis.set_label_position('right')
for ax in axes[1, 0], axes[0, 1], axes[1, 1]:
    ax.set_ylabel(r'Difference between thin and thick slices: $\gamma_\mathrm{t} - \gamma_\mathrm{T}$', fontsize='small')

fig.set_size_inches((9, 8))
fig.tight_layout()
plt.savefig(pltfile)

#+END_SRC

#+RESULTS:
[[file:vca-thin-vs-3d-panels.pdf]]


Stats file: [[file:vca-thin-vs-3d-panels.stats]]

|---+----+-----------------+-----------------|
| O | xy |  -2.80129321429 |  0.055706218749 |
| O | xz |  -2.80475371429 | 0.0480706121397 |
| O | yz |  -2.76559464286 | 0.0686794385519 |
|---+----+-----------------+-----------------|
|   |    |  -2.80 +/- 0.03 | 0.06 +/- 6.0e-3 |
|---+----+-----------------+-----------------|
| H | xy | 0.0819803571429 | 0.0394624680236 |
| H | xz |        0.044183 | 0.0747720280634 |
| H | yz | 0.0639607142857 | 0.0224496108507 |
|---+----+-----------------+-----------------|
|   |    |   0.07 +/- 0.02 |   0.05 +/- 0.02 |
|---+----+-----------------+-----------------|
| N | xy |  0.204757428571 | 0.0115334901465 |
| N | xz |  0.185447571429 | 0.0237116790745 |
| N | yz |        0.167199 | 0.0162491793991 |
|---+----+-----------------+-----------------|
|   |    | 0.19 +/- 8.7e-3 | 0.02 +/- 3.5e-3 |
|---+----+-----------------+-----------------|
| S | xy |  0.205481357143 | 0.0156569303213 |
| S | xz |  0.158641642857 | 0.0161364420871 |
| S | yz |         0.15566 | 0.0131721274234 |
|---+----+-----------------+-----------------|
|   |    | 0.17 +/- 8.5e-3 | 0.01 +/- 9.2e-4 |
|---+----+-----------------+-----------------|
#+TBLFM: @4$3=vmeane(@-II..@-I); f2::@4$4=vmeane(@-II..@-I); f2::@8$3=vmeane(@-II..@-I); f2::@8$4=vmeane(@-II..@-I); f2::@12$3=vmeane(@-II..@-I); f2::@12$4=vmeane(@-II..@-I); f2::@16$3=vmeane(@-II..@-I); f2::@16$4=vmeane(@-II..@-I); f2


*** Velocity widths
All the n=128 PPV cubes have 1.2667 km/s channels

|   n |    dV |
|-----+-------|
| 128 |   1.3 |
|  64 |   2.5 |
|  32 |   5.1 |
|  16 |  10.1 |
|   8 |  20.3 |
|   4 |  40.5 |
|   2 |  81.1 |
|   1 | 162.1 |
#+TBLFM: $2=1.2667 (128/$1) ; f1
*** Halve resolution of PPV cube
#+BEGIN_SRC python :results output
  import numpy as np
  from astropy.io import fits
  
  def double_down(ppv):
      nv, ny, nx = ppv.shape
      return np.reshape(ppv, (nv/2, 2, ny, nx)).sum(axis=1)

  PREFIX = "04052012_4_0030-cube"
  def all_the_way(suffix):
      hdu, = fits.open("bigdata/{}-{}.fits".format(PREFIX, suffix))
      while hdu.data.shape[0] > 1:
          hdu.data = double_down(hdu.data)
          hdu.writeto("bigdata/{}-{:03d}.fits".format(suffix, hdu.data.shape[0]), clobber=True)

  cubes = ["y-Halpha", "n-Halpha", "y-O35007", "n-O35007", 
           "y-N26584", "n-N26584", "y-S26716", "n-S26716", ]
  for cube in cubes:
      all_the_way(cube)
#+END_SRC

#+RESULTS:
#+begin_example
WARNING: Overwriting existing file 'bigdata/y-Halpha-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-Halpha-001.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-Halpha-001.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/y-O35007-001.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-064.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-032.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-016.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-008.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-004.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-002.fits'. [astropy.io.fits.hdu.hdulist]
WARNING: Overwriting existing file 'bigdata/n-O35007-001.fits'. [astropy.io.fits.hdu.hdulist]
#+end_example

*** Table of structure function indices
| Time        | 150,000 |      |      | 200,000 |      |      | 250,000 |      |      | 300,000 |      |      |               |
| Plane       |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z | AVERAGE       |
|-------------+---------+------+------+---------+------+------+---------+------+------+---------+------+------+---------------|
| Hα          |    0.51 | 0.60 | 0.67 |    0.61 | 0.51 | 0.60 |    0.71 | 0.53 | 0.51 |    0.79 | 0.58 | 0.61 | 0.60 +/- 0.03 |
| [OIII]λ5007 |    0.69 | 0.77 | 0.87 |    0.68 | 0.78 | 0.70 |    0.83 | 0.73 | 0.59 |    1.02 | 0.63 | 0.74 | 0.75 +/- 0.03 |
| [NII]λ6584  |    0.46 | 0.54 | 0.58 |    0.54 | 0.44 | 0.56 |    0.60 | 0.48 | 0.55 |    0.66 | 0.63 | 0.53 | 0.55 +/- 0.02 |
| [SII]λ6716  |    0.41 | 0.44 | 0.50 |    0.44 | 0.37 | 0.47 |    0.45 | 0.43 | 0.48 |    0.43 | 0.47 | 0.48 | 0.45 +/- 0.01 |
#+TBLFM: $14=vmeane($2..$13); f2


Same, but without the 150,000 years 
| Time        | 200,000 |      |      | 250,000 |      |      | 300,000 |      |      |               |
| Plane       |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z |     x−y |  x−z |  y−z | AVERAGE       |
|-------------+---------+------+------+---------+------+------+---------+------+------+---------------|
| Hα          |    0.61 | 0.51 | 0.60 |    0.71 | 0.53 | 0.51 |    0.79 | 0.58 | 0.61 | 0.61 +/- 0.03 |
| [OIII]λ5007 |    0.68 | 0.78 | 0.70 |    0.83 | 0.73 | 0.59 |    1.02 | 0.63 | 0.74 | 0.74 +/- 0.04 |
| [NII]λ6584  |    0.54 | 0.44 | 0.56 |    0.60 | 0.48 | 0.55 |    0.66 | 0.63 | 0.53 | 0.55 +/- 0.02 |
| [SII]λ6716  |    0.44 | 0.37 | 0.47 |    0.45 | 0.43 | 0.48 |    0.43 | 0.47 | 0.48 | 0.45 +/- 0.01 |
#+TBLFM: $11=vmeane($2..$10); f2




** Simulation [O III] slopes

| Time |          Thick |        Thin NB |         Thin B |
|------+----------------+----------------+----------------|
|   15 |          -3.47 |          -2.89 |          -3.13 |
|   20 |          -3.29 |          -2.63 |          -2.85 |
|   25 |          -3.40 |          -2.52 |          -2.74 |
|   30 |          -3.37 |          -2.41 |          -2.64 |
|------+----------------+----------------+----------------|
|   15 |          -3.14 |          -2.73 |          -3.01 |
|   20 |          -3.18 |          -2.55 |          -2.76 |
|   25 |          -3.31 |          -2.48 |          -2.69 |
|   30 |          -3.39 |          -2.46 |          -2.68 |
|------+----------------+----------------+----------------|
|   15 |          -3.42 |          -2.51 |          -2.71 |
|   20 |          -3.26 |          -2.51 |          -2.69 |
|   25 |          -3.34 |          -2.45 |          -2.69 |
|   30 |          -3.43 |          -2.58 |          -2.79 |
|------+----------------+----------------+----------------|
|      | -3.33 +/- 0.03 | -2.56 +/- 0.04 | -2.78 +/- 0.04 |
#+TBLFM: @14$2..@14$4=vmeane(@I..@IIII);f2


** Simulation [N II] slopes

| Time |          Thick |        Thin NB |         Thin B |  Thin - Thick |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.41 |          -2.13 |          -2.28 |          0.13 |
|   20 |          -2.61 |          -2.18 |          -2.36 |          0.25 |
|   25 |          -2.42 |          -2.13 |          -2.28 |          0.14 |
|   30 |          -2.58 |          -2.20 |          -2.35 |          0.23 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.38 |          -2.05 |          -2.20 |          0.18 |
|   20 |          -2.48 |          -2.17 |          -2.31 |          0.17 |
|   25 |          -2.61 |          -2.22 |          -2.39 |          0.22 |
|   30 |          -2.52 |          -2.17 |          -2.33 |          0.19 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.42 |          -2.16 |          -2.30 |          0.12 |
|   20 |          -2.44 |          -2.14 |          -2.29 |          0.15 |
|   25 |          -2.63 |          -2.22 |          -2.38 |          0.25 |
|   30 |          -2.66 |          -2.28 |          -2.45 |          0.21 |
|------+----------------+----------------+----------------+---------------|
|      | -2.51 +/- 0.03 | -2.17 +/- 0.02 | -2.33 +/- 0.02 | 0.18 +/- 0.04 |
#+TBLFM: $5=$4 - $2;f2::@14$2..@14$4=vmeane(@I..@IIII);f2

** Simulation [S II] slopes
| Time |          Thick |        Thin NB |         Thin B |  Thin - Thick |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.13 |          -1.76 |          -1.87 |          0.26 |
|   20 |          -2.03 |          -1.82 |          -1.89 |          0.14 |
|   25 |          -1.84 |          -1.69 |          -1.76 |          0.08 |
|   30 |          -1.85 |          -1.59 |          -1.66 |          0.19 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -1.96 |          -1.61 |          -1.69 |          0.27 |
|   20 |          -1.82 |          -1.69 |          -1.74 |          0.08 |
|   25 |          -2.19 |          -1.96 |          -2.02 |          0.17 |
|   30 |          -1.92 |          -1.64 |          -1.71 |          0.21 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.11 |          -1.90 |          -1.96 |          0.15 |
|   20 |          -2.04 |          -1.75 |          -1.86 |          0.18 |
|   25 |          -1.97 |          -1.76 |          -1.80 |          0.17 |
|   30 |          -1.96 |          -1.73 |          -1.78 |          0.18 |
|------+----------------+----------------+----------------+---------------|
|      | -1.99 +/- 0.03 | -1.74 +/- 0.03 | -1.81 +/- 0.03 | 0.18 +/- 0.04 |
#+TBLFM: $5=$4 - $2;f2::@14$2..@14$4=vmeane(@I..@IIII);f2



** Simulation H\alpha slopes

| Time |          Thick |        Thin NB |         Thin B |  Thin - Thick |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.65 |          -2.54 |          -2.67 |         -0.02 |
|   20 |          -2.63 |          -2.41 |          -2.58 |          0.05 |
|   25 |          -2.61 |          -2.31 |          -2.48 |          0.13 |
|   30 |          -2.56 |          -2.23 |          -2.37 |          0.19 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.52 |          -2.49 |          -2.63 |         -0.11 |
|   20 |          -2.55 |          -2.35 |          -2.51 |          0.04 |
|   25 |          -2.60 |          -2.29 |          -2.45 |          0.15 |
|   30 |          -2.53 |          -2.23 |          -2.39 |          0.14 |
|------+----------------+----------------+----------------+---------------|
|   15 |          -2.66 |          -2.40 |          -2.64 |          0.02 |
|   20 |          -2.49 |          -2.26 |          -2.42 |          0.07 |
|   25 |          -2.62 |          -2.29 |          -2.50 |          0.12 |
|   30 |          -2.66 |          -2.35 |          -2.48 |          0.18 |
|------+----------------+----------------+----------------+---------------|
|      | -2.59 +/- 0.02 | -2.35 +/- 0.03 | -2.51 +/- 0.03 | 0.08 +/- 0.04 |
#+TBLFM: $5=$4 - $2;f2::@14$2..@14$4=vmeane(@I..@IIII);f2

